devdnl/dnx-rtos/src/system/drivers/usbd/stm32f1/usbd.c
        return status;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(USBD, void *device_handle, int request, void *arg)
{
        USB_ep_t *hdl    = device_handle;
        int       status = EBADRQC;

        switch (request) {
        case IOCTL_USBD__START:
                if (usb_mem->activated == false) {
                        /* reset USB peripherial */
                        SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                        CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);

                        /* enable USB transceiver */
                        CLEAR_BIT(USB->CNTR, USB_CNTR_PDWN | USB_CNTR_FRES);
                        _sys_sleep_ms(1);

                        /* clear USB IRQ flags */
                        USB->ISTR = 0;

                        /* enable specified USB interrupts */
                        SET_BIT(USB->CNTR, USB_CNTR_CTRM | USB_CNTR_RESETM | USB_CNTR_ERRM /*| USB_CNTR_SOFM*/);

                        usb_mem->activated = true;

                        enable_usb_visible_pullup();

                        while (usb_mem->reset != true) {
                                _sys_sleep_ms(5);
                        }

                        if (_sys_semaphore_wait(usb_mem->ep[USB_EP_NUM__ENDP0]->setup, 1000) == ESUCC) {
                                _sys_semaphore_signal(usb_mem->ep[USB_EP_NUM__ENDP0]->setup);
                        }

                        usb_mem->reset = false;

                        status = ESUCC;
                } else {
                        status = ECANCELED;
                }
                break;

        case IOCTL_USBD__STOP:
                if (usb_mem->activated) {
                        usb_mem->activated = false;

                        disable_usb_visible_pullup();

                        /* reset USB peripherial */
                        SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);
                        CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_USBRST);

                        /* clear semaphores */
                        for (usb_ep_num_t ep = USB_EP_NUM__ENDP0; ep < NUMBER_OF_ENDPOINTS; ep++) {
                                if (usb_mem->ep[ep]) {
                                        if (usb_mem->ep[ep]->rx) {
                                                _sys_semaphore_wait(usb_mem->ep[ep]->rx, 0);
                                        }

                                        if (usb_mem->ep[ep]->tx) {
                                                _sys_semaphore_wait(usb_mem->ep[ep]->tx, 0);
                                        }

                                        if (usb_mem->ep[ep]->setup) {
                                                _sys_semaphore_wait(usb_mem->ep[ep]->setup, 0);
                                        }

                                        usb_mem->ep[ep]->read_in_progress  = false;
                                        usb_mem->ep[ep]->setup_in_progress = false;
                                        usb_mem->ep[ep]->write_in_progress = false;
                                }
                        }

                        usb_mem->ep_config = NULL;

                        status = ESUCC;
                } else {
                        status = ECANCELED;
                }
                break;

        case IOCTL_USBD__CONFIGURE_EP_1_7:
                if (arg) {
                        if (usb_mem->activated) {
                                usb_mem->ep_config = arg;
                                status = configure_endpoints_1_7() ? ESUCC : EIO;
                        } else {
                                status = EBUSY;
                        }
                } else {
                        status = EINVAL;
                }
                break;

        case IOCTL_USBD__SET_ADDRESS:
                if (usb_mem->activated) {
                        USB->DADDR = USB_DADDR_EF | ((int)arg & USB_DADDR_ADD);
                        status = ESUCC;
                } else {
                        status = ECANCELED;
                }
                break;

        case IOCTL_USBD__SEND_ZLP:
                if (usb_mem->activated) {
                        status = send_ZLP(hdl->minor);
                } else {
                        status = ECANCELED;
                }
                break;

        case IOCTL_USBD__SET_EP_STALL:
                if (usb_mem->activated) {
                        int ep = (int)arg;

                        if ((ep & 0x7) < NUMBER_OF_ENDPOINTS) {
                                if (ep & USB_ENDP_IN) {
                                        set_ep_tx_status(ep & 0x7, USB_EP_STATUS__STALL);
                                } else {
                                        set_ep_rx_status(ep & 0x7, USB_EP_STATUS__STALL);
                                }

                                status = ESUCC;
                        } else {
                                status = EINVAL;
                        }
                } else {
                        status = ECANCELED;
                }
                break;

        case IOCTL_USBD__SET_EP_VALID:
                if (usb_mem->activated) {
                        int ep = (int)arg;

                        if ((ep & 0x7) < NUMBER_OF_ENDPOINTS) {
                                if (ep & USB_ENDP_IN) {
                                        set_ep_tx_status(ep & 0x7, USB_EP_STATUS__VALID);
                                } else {
                                        set_ep_rx_status(ep & 0x7, USB_EP_STATUS__VALID);
                                }

                                status = ESUCC;
                        } else {
                                status = EINVAL;
                        }
                } else {
                        status = ECANCELED;
                }
                break;

        case IOCTL_USBD__WAS_RESET:
                if (arg) {
                        if (usb_mem->activated) {
                                _sys_critical_section_begin();
                                bool reset     = usb_mem->reset;
                                usb_mem->reset = false;
                                _sys_critical_section_end();
                                *reinterpret_cast(bool*, arg) = reset;
                                status = ESUCC;
                        } else {
                                status = ECANCELED;
                        }
                } else {
                        status = EINVAL;
                }
                break;

